DataProcessors/umk_ЗагрузкаДанныхИзКБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>umk_ЗагрузкаДанныхИзКБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДляНовыхКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/umk_СоответствиеТиповДокументаДляКлиентБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>umk_СоответствиеТиповДокументаДляКлиентБанка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВычислитьЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/umk_СоответствиеРеквизитовДляКлиентБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>umk_СоответствиеРеквизитовДляКлиентБанка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СоответствиеРеквизитовПолей</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоответствиеРеквизитовПолейТаб</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаОтТретьихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаТранзитныхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НастройкаТранзитныхСчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СчетОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ_отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ_получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВыполнятьДвижения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийППИсходящее</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетБУПолучатель</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииППвх</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОплатаИсходящаяБК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОплатаИсходящаяБК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСчетаПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСчетаПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийППИсходящее</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчетаРасчетовСКонтрагентом</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоДт1</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоДт2</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоДт3</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанкСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>(Общ) Банковский счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОплатаВходящаяБК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОплатаВходящаяБК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСчетаОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСчетаОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчетаРасчетовСКонтрагентом</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоКт1</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоКт2</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоКт3</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанкСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>(Общ) Банковский счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/umk_Путь_К_КаталогуКлиентБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>umk_Путь_К_КаталогуКлиентБанка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗагрузкаПоДате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеБезналичныхДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеБезналичныхДенежныхСредств</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступлениеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПродажаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоПлатежнымКартам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоБанковскимКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеСредствОтФСС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/umk_ЗагрузкаДанныхИзКБ/Ext/ObjectModule.bsl
Перем МассивДокументов;

#Область ЗагрузкиДанных

//Выполнить загрузку данных из внешнего источника
//
Процедура ВыполнитьЗагрузку()Экспорт
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	РасширениеФайла = РаботаСФайлами.ПолучитьРасширениеФайла(ПутьКФайлу);
	
	Если РасширениеФайла = "dbf" Тогда
		
		db_file = Новый XBase;
		db_file.Кодировка = КодировкаXBase.OEM;
		db_file.ОткрытьФайл(ПутьКФайлу);
		
		Если Не db_file.Открыта()
			Тогда
			#Если Клиент Тогда
				Сообщить("Файл базы не открыт.", СтатусСообщения.Важное);	
			#КонецЕсли
			Возврат
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Организация)
			Тогда
			#Если Клиент Тогда
				Сообщить("Организация не заполнена.", СтатусСообщения.Важное);	
			#КонецЕсли
			Возврат
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(БанковскийСчет)
			Тогда
			#Если Клиент Тогда
				Сообщить("Банковский счет не заполнен.", СтатусСообщения.Важное);	
			#КонецЕсли
			Возврат
		КонецЕсли;
		
		ТаблицаЗначений = ПодготовитьТаблицуЗначений_dbf(db_file);
		
	ИначеЕсли РасширениеФайла = "csv" Тогда
		
		ТаблицаЗначений = ПодготовитьТаблицуЗначений_csv(ПутьКФайлу);
		
	КонецЕсли;
	
	МассивДокументов.Очистить();
	
	СоздатьДокумент(ТаблицаЗначений);
	
	ПровестиДокументы();
	
КонецПроцедуры

//Возвращает таблицу значений полученную из внешнего источника dbf 
//
Функция ПодготовитьТаблицуЗначений_dbf(db_file)
	
	ТаблицаЗначений = Новый ТаблицаЗначений();
	
	Для Каждого Поле из db_file.поля Цикл
		ТаблицаЗначений.Колонки.Добавить(Поле.Имя);	
	КонецЦикла;
	
	Пока Истина  Цикл
		НоваяСтрока = ТаблицаЗначений.Добавить();
		Для Каждого Поле из db_file.поля Цикл
			НоваяСтрока[Поле.Имя] = db_file.ПолучитьЗначениеПоля(Поле.Имя);
		КонецЦикла;
		
		Если Не db_file.Следующая()
			Тогда
			Прервать
		КонецЕсли
		
	КонецЦикла;
	
	Возврат ТаблицаЗначений
	
КонецФункции

//Возвращает таблицу значений полученную из внешнего источника
//
Функция ПодготовитьТаблицуЗначений_csv(ПутьКФайлу)
	
	ФайлCSV = Новый текстовыйДокумент;
	ФайлCSV.Прочитать(ПутьКФайлу);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ИспользуемыйРазделитель =";";
	
	//*** Если есть шапка таблицы ***
	ШапкаCSV = ФайлCSV.ПолучитьСтроку(1);
	// Чтение и разделение на отдельные значения в массив (по разделителю)
	МассивCSV = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ШапкаCSV, ИспользуемыйРазделитель);//СтрРазделить(ШапкаCSV, ИспользуемыйРазделитель);
	//***************************
	Для Каждого СтрокаНом Из МассивCSV Цикл
		
		// Удаляем пробелы т.к. в названии столбцов они не допускаются
		ИмяБП = СтрЗаменить(СтрокаНом," ","_");
		ТаблицаЗначений.Колонки.Добавить(ИмяБП,, СтрокаНом);
		
	КонецЦикла;
	
	Для НомерСтроки=2 По ФайлCSV.КоличествоСтрок() Цикл // Если без шапки, то начинаем с первой строчки
		
		// Получаем строку по-порядку
		СтрокаCSV = ФайлCSV.ПолучитьСтроку(НомерСтроки);
		
		// Разделяем с помощью выбранного разделителя каждую строку на столбцы
		МассивCSV = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаCSV, ИспользуемыйРазделитель);//СтрРазделить(СтрокаCSV, ИспользуемыйРазделитель);
		НоваяСтрочка= ТаблицаЗначений.Добавить();// Добавляем строку в ТЗ
		
		Для НомСтолбца=1 По МассивCSV.Количество() Цикл
			
			ТекЗначениеCSV = МассивCSV[НомСтолбца-1];
			ИмяКолонкиCSV = ТаблицаЗначений.Колонки[НомСтолбца-1].Имя;
			НоваяСтрочка[ИмяКолонкиCSV] = ТекЗначениеCSV;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаЗначений;
	
КонецФункции

//Создадим платежный документ
//
Процедура СоздатьДокумент(ТаблицаЗначений)
	
	Для Каждого СтрокаЗначения Из ТаблицаЗначений Цикл
		СчетТранзитный = Ложь;
		ТипДокумента   = ПолучитьТипДокумента(СтрокаЗначения);
		// Определим транзитная операция или нет
		
		СруктураДанныхТранзита = ПолучитьСруктураДанныхТранзита(БанковскийСчет, СтрокаЗначения, ТипДокумента);
		
		Если  Не СруктураДанныхТранзита = Неопределено
			Тогда 
			СчетТранзитный = Истина
		КонецЕсли;
		
		
		Если ТипДокумента = Неопределено
			Тогда
			#Если Клиент Тогда
				Сообщить("Определите тип документа в настройках обмена с ""Клиент-банком"".", СтатусСообщения.Важное);	
			#КонецЕсли
			Продолжить
		КонецЕсли;
		
		Документ = Документы[ТипДокумента].СоздатьДокумент();
		Документ.ОбменДанными.Загрузка = Истина;
		Документ.ОтражатьВБухгалтерскомУчете  = Истина;
		Документ.ОтражатьВУправленческомУчете = Истина;
		Документ.Оплачено = Истина;
		Документ.Организация = Организация;
		Документ.СчетОрганизации = БанковскийСчет;
		Документ.УстановитьНовыйНомер(Организация.Префикс);
		
		// Заполним шапку документа
		СответствиеРеквизитов = ПолучитьСответствиеРеквизитов(ТипДокумента, "СоответствиеРеквизитовПолей");
			
		// Опредилим сначала назначение
		Для Каждого Элемент Из СответствиеРеквизитов Цикл
			
			Если Элемент.Значение = "НазначениеПлатежа"  Тогда
				Документ[Элемент.Значение] = СтрокаЗначения[Элемент.Ключ];
			КонецЕсли;
			
		КонецЦикла;
				
		// Установим Нашу оплату
		Назначение =  Документ.НазначениеПлатежа;
		мЕДРПОУ = "";
		НашаОплата = Ложь;
		
		Если БанковскийСчет.ОплатаОтТретьихЛиц Тогда // 22/12/20
			НашаОплата = ПлатежОтТретьихЛиц(ТипДокумента, Назначение, мЕДРПОУ);
			Документ.umk_НашаОплата = НашаОплата;
		КонецЕсли;
		
		Для Каждого Элемент Из СответствиеРеквизитов Цикл
			
			Если Элемент.Значение = "Контрагент"
				Тогда
				Если Не НашаОплата
					Тогда
					мЕДРПОУ = СокрЛП(Строка(СтрокаЗначения[Элемент.Ключ]));
					Документ[Элемент.Значение] =  ПолучитьКонтрагентаУМК(СокрЛП(Строка(СтрокаЗначения[Элемент.Ключ])));//Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ",СокрЛП(Строка(СтрокаЗначения[Элемент.Ключ]))); 
					//Попроуем найти по ЕДРПОУ
					Если не ЗначениеЗаполнено(Документ[Элемент.Значение]) Тогда
						Документ[Элемент.Значение] =  Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ",мЕДРПОУ);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Элемент.Значение = "ВалютаДокумента"
				Тогда
				Валюта = Справочники.Валюты.НайтиПоКоду(СокрЛП(Строка(СтрокаЗначения[Элемент.Ключ])));
				Валюта = ?(ЗначениеЗаполнено(Валюта), Валюта, глЗначениеПеременной("ВалютаРегламентированногоУчета"));
				Документ[Элемент.Значение] = Валюта; 	
			ИначеЕсли Элемент.Значение = "ДатаОплаты"
				Тогда
				ДатаДокумента = СтрокаЗначения[Элемент.Ключ];
				ДатаДокумента = ФорматДаты(ДатаДокумента);
				Документ[Элемент.Значение] = ДатаДокумента; 	
			Иначе
				Документ[Элемент.Значение] = СтрокаЗначения[Элемент.Ключ];
			КонецЕсли;
			
		КонецЦикла;
		
		Если Документ.umk_НашаОплата Тогда
			
			Документ.Контрагент = КонтрагентПоНазначению(Документ.НазначениеПлатежа, ТипДокумента, мЕДРПОУ);
			
		КонецЕсли;
		
		Документ.Дата = КонецДня(Документ.ДатаОплаты);
		
		Если ВыборкаПоДате() Тогда
			
			Если Не Дата = НачалоДня(Документ.Дата) Тогда  
				СтараяДата =  Документ.Дата;
				Документ.Дата = КонецДня(Дата);
				Документ.ДатаОплаты = Документ.Дата; 
				
				#Если Клиент Тогда
					Сообщить("Дата обработки на равна дате документа ""Клиент-банка"" " + Строка(СтараяДата)  
					+ ". " + Документ.НазначениеПлатежа, СтатусСообщения.Важное);	
				#КонецЕсли
				
				//Продолжить
			КонецЕсли;
			
		КонецЕсли;
			
		Если ТипДокумента = "ПлатежноеПоручениеВходящее" Тогда
			Документ.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
			
			//06.05.20
			Если ЭтоВозвратДенежныхСредств(Назначение) Тогда
				Документ.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком;	
			КонецЕсли;
				
			// Если Транзитный установим значения
			Если СчетТранзитный Тогда
				Документ.ВидОперации     = СруктураДанныхТранзита.ВидОперации;
				Документ.Оплачено        = СруктураДанныхТранзита.ВыполнятьДвижения;
				Документ.СчетУчетаРасчетовСКонтрагентом = СруктураДанныхТранзита.СчетБУ;
			КонецЕсли;
			// КонецПо транзиту
			
			Документ.НомерВходящегоДокумента = СокрЛП(Документ.НомерВходящегоДокумента);
			Документ.КлючПоиска = Документ.НомерВходящегоДокумента + мЕДРПОУ;
			
			//Установим вид оплаты субконто в зависимости от банк. счета
			УстановитьВидОплатыСубконтоППвх(Документ, СтрокаЗначения);
			
			Если Документ.Дата <= '20250401235959' Тогда 
				
				Если ЕстьЗаписанныйДокументВБазу(ТипДокумента,"НомерВходящегоДокумента", Документ.Дата, Документ.НомерВходящегоДокумента)
					Тогда
					Продолжить // Не будем записывать в базу
				КонецЕсли;
				
			Иначе // Другой алгоритм поиска
				
				Если ЕстьЗаписанныйДокументВБазу(ТипДокумента,"КлючПоиска", Документ.Дата, Документ.КлючПоиска)
					Тогда
					Продолжить // Не будем записывать в базу
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТипДокумента = "ПлатежноеПоручениеИсходящее" Тогда
			Документ.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику;
						
			// Если Транзитный установим значения
			Если СчетТранзитный Тогда
				
				Документ.ВидОперации     = СруктураДанныхТранзита.ВидОперации;
				Документ.СчетКонтрагента = СруктураДанныхТранзита.СчетПолучатель;
				Документ.Оплачено        = СруктураДанныхТранзита.ВыполнятьДвижения;
				Документ.СчетУчетаРасчетовСКонтрагентом = СруктураДанныхТранзита.СчетБУ;
				
			КонецЕсли;
			// КонецПо транзиту
			
			//Установим вид оплаты субконто в зависимости от банк. счета
			УстановитьВидОплатыСубконтоППисх(Документ, СтрокаЗначения);
			
			Документ.НомерПоручения = СокрЛП(Документ.НомерПоручения);
			
			Если ЕстьЗаписанныйДокументВБазу(ТипДокумента,"НомерПоручения", Документ.Дата, Документ.НомерПоручения)
				Тогда
				Продолжить // Не будем записывать в базу
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не НашаОплата И Не ЗначениеЗаполнено(Документ.Контрагент)  Тогда
			
			#Если Клиент Тогда
				
				Режим = РежимДиалогаВопрос.ДаНет;
				Ответ = Вопрос("В базе не найден контрагент с кодом ЕДРПОУ " + мЕДРПОУ + ". Хотите создать?", Режим, 0);
				
				Если Ответ = КодВозвратаДиалога.Нет Тогда
					Документ.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
				Иначе
					Документ.Контрагент = СоздатьКонтрагента(мЕДРПОУ, Документ.umk_КонтрагентСтрокой, ТипДокумента);
				КонецЕсли;
				
			#Иначе	
				Документ.Контрагент = СоздатьКонтрагента(мЕДРПОУ, Документ.umk_КонтрагентСтрокой, ТипДокумента);
			#КонецЕсли
			
		КонецЕсли;
		
		// Заполним расшифровку платежа
		СтрокаПлатеж = Документ.РасшифровкаПлатежа.Добавить();
		
		СответствиеРеквизитовТаб = ПолучитьСответствиеРеквизитов(ТипДокумента, "СоответствиеРеквизитовПолейТаб");
		
		Для Каждого Элемент Из СответствиеРеквизитовТаб Цикл
			
			СтрокаПлатеж[Элемент.Значение] = СтрокаЗначения[Элемент.Ключ];
			
		КонецЦикла;
		
		// Дозаполним недостающие реквизиты
		Если ТипДокумента = "ПлатежноеПоручениеВходящее" Тогда
			
			// Установим договор
			СписокДопустимыхВидовДоговоров          = УправлениеВзаиморасчетами.ОпределитьВидДоговораСКонтрагентом(Документ.ВидОперации);
			СтруктураПараметровДляПолученияДоговора = Новый Структура ("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
			СтрокаПлатеж.ДоговорКонтрагента         = ЗаполнениеДокументов.ПолучитьДоговорПоОрганизацииИКонтрагенту(
			Документ.Организация, Документ.Контрагент, СтруктураПараметровДляПолученияДоговора);
				
			// При изменении договора			
			СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = СтрокаПлатеж.ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств; 
			УправлениеДенежнымиСредствами.УстановитьСтатьюДДСПоУмолчанию(СтрокаПлатеж, Документ.ВидОперации);
			
			СтрокаПлатеж.ДокументПланированияПлатежа=Документы.ПланируемоеПоступлениеДенежныхСредств.ПустаяСсылка();
			
			мТекущаяВалютаВзаиморасчетов = СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов;
			
			СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(мТекущаяВалютаВзаиморасчетов, ?(НЕ ЗначениеЗаполнено(Документ.ДатаОплаты),Документ.Дата,Документ.ДатаОплаты));
			
			СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
			СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
			
			//РассчитатьСуммуВзаиморасчетов
			Если мТекущаяВалютаВзаиморасчетов = Документ.ВалютаДокумента Тогда
				
				СтрокаПлатеж.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа;
				
			ИначеЕсли (Документ.КурсДокумента <> 0) И (СтрокаПлатеж.КратностьВзаиморасчетов <> 0) И (СтрокаПлатеж.КурсВзаиморасчетов <> 0) Тогда
				
				СтрокаПлатеж.СуммаВзаиморасчетов=МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаПлатежа, Документ.ВалютаДокумента,
				мТекущаяВалютаВзаиморасчетов,
				Документ.КурсДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
				Документ.КратностьДокумента, СтрокаПлатеж.КратностьВзаиморасчетов);
				
			Иначе
				
				СтрокаПлатеж.СуммаВзаиморасчетов = 0;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента.ОсновнойПроект) Тогда
				СтрокаПлатеж.Проект = СтрокаПлатеж.ДоговорКонтрагента.ОсновнойПроект;
			КонецЕсли;
			
			СчетаУчета = Неопределено;
			
			ОпределитьСчетаУчетаРасчетовСКонтрагентомППВХ (СтрокаПлатеж,,Документ);
			
			Если Не ЗначениеЗаполнено(СтрокаПлатеж.СтавкаНДС) Тогда
				СтрокаПлатеж.СтавкаНДС = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяСтавкаНДС");
			КонецЕсли;
			
			УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(СтрокаПлатеж);
			
			СтрокаПлатеж.Сделка = Неопределено;
			СтрокаПлатеж.ДокументРасчетовСКонтрагентом = Неопределено;
				
		КонецЕсли;
		
		Если ТипДокумента = "ПлатежноеПоручениеИсходящее" Тогда
			
			//Установим договор
			СписокДопустимыхВидовДоговоров          = УправлениеВзаиморасчетами.ОпределитьВидДоговораСКонтрагентом(Документ.ВидОперации);
			СтруктураПараметровДляПолученияДоговора = Новый Структура ("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
			СтрокаПлатеж.ДоговорКонтрагента         = ЗаполнениеДокументов.ПолучитьДоговорПоОрганизацииИКонтрагенту(
			Документ.Организация, Документ.Контрагент, СтруктураПараметровДляПолученияДоговора);
						
			ПриИзмененииДоговораППИСХ(Документ, СтрокаПлатеж);	
			
		КонецЕсли;
			
		Документ.Ответственный = глЗначениеПеременной("глТекущийПользователь");
		Документ.СчетБанк = ПланыСчетов.Хозрасчетный.ТекущиеСчетаВНациональнойВалюте;
		Документ.СуммаДокумента = Документ.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		Документ.Записать();
		
		МассивДокументов.Добавить(Документ.Ссылка);
		
		Сообщить("Загружен документ " + Документ.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныхПроцедурИФункций

//Преобразует тип строки в тип дата
//
Функция ФорматДаты(ДатаДокумента)
	
	
	Если ТипЗнч(ДатаДокумента) =  Тип("Дата") Тогда
		Возврат ДатаДокумента
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		Возврат '00010101'
	КонецЕсли;
	
	МассивДат = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДатаДокумента,".");
	
	//Проверим порядок ГГГГ.ММ.ДД
	Если СтрДлина(МассивДат[0])= 2 Тогда //Перевернем массив
		Возврат Дата(МассивДат[2],МассивДат[1],МассивДат[0]);
	КонецЕсли;
	
	Возврат Дата(МассивДат[0],МассивДат[1],МассивДат[2]);
	
КонецФункции

//Возвращает соответствие типов
//
Функция ПолучитьТипДокумента(СтрокаЗначения)
	
	ЗначениеПоФормуле = "";
	
	// Получим ключ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеТиповДокументаДляКлиентБанка.Ключ,
	|	СоответствиеТиповДокументаДляКлиентБанка.ВычислитьЗначение
	|ИЗ
	|	РегистрСведений.umk_СоответствиеТиповДокументаДляКлиентБанка КАК СоответствиеТиповДокументаДляКлиентБанка
	|ГДЕ
	|	СоответствиеТиповДокументаДляКлиентБанка.Организация = &Организация
	|	И СоответствиеТиповДокументаДляКлиентБанка.БанковскийСчет = &БанковскийСчет";
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий()
		Тогда
		Ключ = Выборка.Ключ;
		ЗначениеПоФормуле = Выборка.ВычислитьЗначение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Значение =  СтрокаЗначения[Ключ];
		
	Если ЗначениеЗаполнено(ЗначениеПоФормуле) Тогда
		Попытка
			Значение = Вычислить(ЗначениеПоФормуле);
		Исключение
			ВызватьИсключение;
		КонецПопытки
	КонецЕсли;
	
	// Получим значение 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеТиповДокументаДляКлиентБанка.ТипДокумента
	|ИЗ
	|	РегистрСведений.umk_СоответствиеТиповДокументаДляКлиентБанка КАК СоответствиеТиповДокументаДляКлиентБанка
	|ГДЕ
	|	СоответствиеТиповДокументаДляКлиентБанка.Организация = &Организация
	|	И СоответствиеТиповДокументаДляКлиентБанка.БанковскийСчет = &БанковскийСчет
	|	И СоответствиеТиповДокументаДляКлиентБанка.Значение = &Значение";
	
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Значение", Строка(Значение));
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий()
		Тогда Возврат Выборка.ТипДокумента;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//Возвращает булево
//
Функция ПлатежОтТретьихЛиц(ТипДокумента, Назначение, ЕДРПОУ = "")
	//// Уберем этот механизм пока
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СоответствиеРеквизитовДляКлиентБанка.ОплатаОтТретьихЛиц КАК ОплатаОтТретьихЛиц
	//	|ИЗ
	//	|	РегистрСведений.umk_СоответствиеРеквизитовДляКлиентБанка КАК СоответствиеРеквизитовДляКлиентБанка
	//	|ГДЕ
	//	|	СоответствиеРеквизитовДляКлиентБанка.Организация = &Организация
	//	|	И СоответствиеРеквизитовДляКлиентБанка.БанковскийСчет = &БанковскийСчет
	//	|	И СоответствиеРеквизитовДляКлиентБанка.ТипДокумента = &ТипДокумента";
	//
	//Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	//Запрос.УстановитьПараметр("Организация", Организация);
	//Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	Возврат  Выборка.ОплатаОтТретьихЛиц
	//Иначе
	//	Возврат Ложь
	//КонецЕсли;
	//
	
	////Провека платежа от третьих лиц будем проводить по назначению платежа
	//
	//Если Найти(Назначение,"Сплата за продукцію код ") = 1 ИЛИ 
	//	Найти(Назначение,"Сплата за продукц_ю код ") = 1 ИЛИ
	//	Найти(Назначение,"Сплата за прод.") = 1 ИЛИ
	//	Найти(Назначение,"Сплата за аренду код ") = 1  Тогда
	//	Возврат Истина
	//Иначе
	//	Возврат Ложь;
	//КонецЕсли;
	
	//с 24/09/2020  - новый механизм. Если находим в назначении платежа КодЕДРПОУ (8 или 10 знаков) то
	//полагаем, что это оплата от третьего лица
	
	Если ТипДокумента = "ПлатежноеПоручениеИсходящее" Тогда
		Возврат Ложь
	КонецЕсли;
	
	МассивДлинСимволов = Новый Массив();
	
	МассивДлинСимволов.Добавить(11); //Физлицо 10 зн. + 1 пробел.
	МассивДлинСимволов.Добавить(9); //Юрлицо 8 зн. + 1 пробел.
	
	
	Для Каждого ДлинаЕДРПОУ Из МассивДлинСимволов Цикл
		
		НомерСимвола = 1;
		СтрокаСЧислом = Назначение;
		ДлинаСтроки = СтрДлина(СтрокаСЧислом) -ДлинаЕДРПОУ;
		
		Пока НомерСимвола <= ДлинаСтроки Цикл
			Попытка
				
				ЕДРПОУ_Строка = Сред(СтрокаСЧислом,НомерСимвола,ДлинаЕДРПОУ);
				
				//Если разделитель тогда пропускаем
				Если Найти(ЕДРПОУ_Строка,".") ИЛИ Найти(ЕДРПОУ_Строка,",") ИЛИ НЕ
					ЗначениеЗаполнено(ЕДРПОУ_Строка)
					Тогда
					НомерСимвола = НомерСимвола + 1;
					Продолжить
				КонецЕсли;
				
				ЕДРПОУ_число = Число(ЕДРПОУ_Строка);
				ЕДРПОУ = Формат(ЕДРПОУ_число,"ЧЦ="+Строка(ДлинаЕДРПОУ-1)+"; ЧДЦ=0; ЧГ=");
				
				//Если знаков не 8 и не 10 то это не ЕДРПОУ
				Если НЕ СтрДлина(ЕДРПОУ) = 8
					И
					НЕ СтрДлина(ЕДРПОУ) = 10
					Тогда
					НомерСимвола = НомерСимвола + 1;
					Продолжить
				КонецЕсли;
				
				//Полагаем, что таких ЕДРПОУ нет.
				Если Не Прав(ЕДРПОУ,ДлинаЕДРПОУ-1) = "0" //Не лидирующий 0
					Тогда
					Возврат Истина
				КонецЕсли;		
			Исключение
			КонецПопытки;
			НомерСимвола = НомерСимвола + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Ложь
	
	
КонецФункции

// Определяем тип документа в зависимости от назначения платежа. Для Возврата денежных средств
Функция ЭтоВозвратДенежныхСредств(Назначение)
	
	Если Найти(Назначение,"Повернення ") = 1 ИЛИ 
		Найти(Назначение,"Поверн. ") = 1 ИЛИ
		Найти(Назначение,"Возврат ") = 1  Тогда
		Возврат Истина
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//Возвращает соответствие реквизитов документов
//
Функция ПолучитьСответствиеРеквизитов(ТипДокумента, ПоляВыбора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	umk_СоответствиеРеквизитовДляКлиентБанка."+ ПоляВыбора + " КАК Поля
	|ИЗ
	|	РегистрСведений.umk_СоответствиеРеквизитовДляКлиентБанка КАК umk_СоответствиеРеквизитовДляКлиентБанка
	|ГДЕ
	|	umk_СоответствиеРеквизитовДляКлиентБанка.Организация = &Организация
	|	И umk_СоответствиеРеквизитовДляКлиентБанка.БанковскийСчет = &БанковскийСчет
	|	И umk_СоответствиеРеквизитовДляКлиентБанка.ТипДокумента = &ТипДокумента";
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТаблицаРеквизитов = Выборка.Поля.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	СоответствиеПолей = Новый Соответствие;
	
	Для Каждого Строка Из ТаблицаРеквизитов Цикл
		
		СоответствиеПолей.Вставить(Строка.Ключ, Строка.Значение)
		
	КонецЦикла;
	
	Возврат СоответствиеПолей
	
КонецФункции

//Проверяет наличие уже записанных в базу документов
//
Функция ЕстьЗаписанныйДокументВБазу(ТипДокумента, Реквизит, Документ_Дата, Номер)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПлатежныйДокумент.Ссылка
	|ИЗ
	|	Документ." + ТипДокумента + " КАК ПлатежныйДокумент
	|ГДЕ
	|	ПлатежныйДокумент.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ПлатежныйДокумент." + Реквизит + " = &Номер");
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Документ_Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Документ_Дата));
	Запрос.УстановитьПараметр("Номер", Номер);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Возврат Выборка.Следующий()
	
	
КонецФункции

//Возвращает контрагента по назначению платежа
//
Функция КонтрагентПоНазначению(Назначение, ТипДокумента, ЕДРПОУ)
	//Возможные варианты
	//Назначение = СтрЗаменить(Назначение,"Сплата за продукцію код ",""); 
	//Назначение = СтрЗаменить(Назначение,"Сплата за продукц_ю код ","");
	//Назначение = СтрЗаменить(Назначение,"Сплата за аренду код ", "");
	//
	//ЕДРПОУ = Лев(Назначение,10);
	//ЕДРПОУ = СокрЛП(ЕДРПОУ);
	//// Если есть пробелы в едрпоу, то скорее всего это платеж от юр. лица и у едрпоу - 8 знаков
	//Если Найти(ЕДРПОУ, " ") Тогда
	//	ЕДРПОУ = СокрЛП(Лев(ЕДРПОУ, Найти(ЕДРПОУ, " ")));	
	//КонецЕсли;
	//
	
	Контрагент =  ПолучитьКонтрагентаУМК(ЕДРПОУ);//Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ",ЕДРПОУ);
	
	Если Не значениеЗаполнено(Контрагент) Тогда//Контрагент.Пустая() Тогда
		
		ПараметрПоиска = ", від "; // Место с которого начнем искать Наименование контрагента
		
		ПозицияНаименования = Найти(Назначение, ПараметрПоиска);
		
		Если ПозицияНаименования = 0
			Тогда
			Возврат Справочники.Контрагенты.ПустаяСсылка(); // Не будем создавать
		Иначе
			НачальныйНомер = ПозицияНаименования + СтрДлина(ПараметрПоиска);
			Наименование =  Сред(Назначение,НачальныйНомер,100); 
			Наименование = СокрЛП(Наименование);
		КонецЕсли;
		
		#Если Клиент Тогда
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("В базе не найден контрагент с кодом ЕДРПОУ " + ЕДРПОУ + ". Хотите создать?", Режим, 0);
			
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат Справочники.Контрагенты.ПустаяСсылка();
			Иначе
				Контрагент = СоздатьКонтрагента(ЕДРПОУ, Наименование, ТипДокумента);
			КонецЕсли;
		#Иначе
			Контрагент = СоздатьКонтрагента(ЕДРПОУ, Наименование, ТипДокумента);	
		#КонецЕсли
		
	КонецЕсли;
	
	
	Возврат Контрагент
	
КонецФункции

//Возвращает нового контрагента
//Создает договор
//
Функция СоздатьКонтрагента(ЕДРПОУ, Наименование, ТипДокумента)
	
	Если ЕДРПОУ = ""
		Тогда
		Возврат 
		Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Если Наименование = "" Тогда
		Наименование = "Новый контрагент, код ЕДРПОУ: " + ЕДРПОУ;
	КонецЕсли;
	
	
	Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
	Контрагент.Наименование = Наименование;
	Контрагент.НаименованиеПолное = Наименование;
	Контрагент.КодПоЕДРПОУ = ЕДРПОУ;
	Контрагент.Покупатель = ТипДокумента = "ПлатежноеПоручениеВходящее";
	Контрагент.Поставщик =  ТипДокумента = "ПлатежноеПоручениеИсходящее";
	Контрагент.ЮрФизЛицо = ?(СтрДлина(ЕДРПОУ) = 10, Перечисления.ЮрФизЛицо.ФизЛицо, Перечисления.ЮрФизЛицо.ЮрЛицо);
	Контрагент.Записать();
	ПроверитьОсновнойДоговорКонтрагента(Контрагент);
	Контрагент.Родитель = КаталогДляНовыхКонтрагентов;
	Контрагент.Записать();
	
	Возврат Контрагент.Ссылка
	
КонецФункции

// Получаем выборку по транзитным счетам
Функция ПолучитьСруктураДанныхТранзита(БанковскийСчет, СтрокаЗначения, ТипДокумента)
	
	// Получи ключ - получатель
	Если ТипДокумента = "ПлатежноеПоручениеИсходящее" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаТранзитныхСчетов.Ключ_получатель,
		|	НастройкаТранзитныхСчетов.ВыполнятьДвижения,
		|	НастройкаТранзитныхСчетов.СчетПолучатель.НомерСчета КАК СчетПолучательНомер,
		|	НастройкаТранзитныхСчетов.СчетПолучатель КАК СчетПолучатель,
		|	НастройкаТранзитныхСчетов.ВидОперации,
		|	НастройкаТранзитныхСчетов.СчетБУПолучатель
		|ИЗ
		|	РегистрСведений.НастройкаТранзитныхСчетов КАК НастройкаТранзитныхСчетов
		|ГДЕ
		|	НастройкаТранзитныхСчетов.СчетОтправитель = &СчетОтправитель";
		
		Запрос.УстановитьПараметр("СчетОтправитель", БанковскийСчет);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		
		Пока Выборка.Следующий() Цикл
			ЗаписиВРегистре = Истина;  // Нашли записи в регистре соответствий
			
			КлючПолучатель         = Выборка.Ключ_получатель;
			ВидОперации            = Выборка.ВидОперации;
			СчетПолучательНомер    = Выборка.СчетПолучательНомер;
			СчетПолучатель         = Выборка.СчетПолучатель;
			ВыполнятьДвижения      = Выборка.ВыполнятьДвижения;
			СчетБУ                 = Выборка.СчетБУПолучатель;
			
			// Если счет транзитный
			// Попробуем получить строку по ключу, обходим всю выборку пока не найдем 		
			Попытка
				Строка = СокрЛП(СтрокаЗначения[КлючПолучатель]);
			Исключение
				Продолжить	
			КонецПопытки;
			
			// Нашли ключ:
			
			Если СокрЛП(СтрокаЗначения[КлючПолучатель]) = СокрЛП(СчетПолучательНомер) Тогда
				СруктураДанных = Новый Структура("СчетПолучатель,ВыполнятьДвижения,ВидОперации, СчетБУ",
				СчетПолучатель,ВыполнятьДвижения,ВидОперации, СчетБУ);
				Возврат СруктураДанных
			КонецЕсли;
			
		КонецЦикла;
		
		// не нашли ничего.	
		Возврат Неопределено;		
		
		
		
	ИначеЕсли  ТипДокумента = "ПлатежноеПоручениеВходящее" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаТранзитныхСчетов.Ключ_отправитель,
		|	НастройкаТранзитныхСчетов.СчетОтправитель.НомерСчета КАК СчетОтправительНомер,
		|	НастройкаТранзитныхСчетов.СчетОтправитель,
		|	НастройкаТранзитныхСчетов.ВидОперацииППвх,
		|	НастройкаТранзитныхСчетов.СчетБУПолучатель
		|ИЗ
		|	РегистрСведений.НастройкаТранзитныхСчетов КАК НастройкаТранзитныхСчетов
		|ГДЕ
		|	НастройкаТранзитныхСчетов.СчетПолучатель = &СчетПолучатель";
		
		Запрос.УстановитьПараметр("СчетПолучатель", БанковскийСчет);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		ЗаписиВРегистре = Ложь;
		
		Пока Выборка.Следующий() Цикл
			ЗаписиВРегистре = Истина;  // Нашли записи в регистре соответствий
			КлючОтправитель      = Выборка.Ключ_отправитель;
			СчетОтправительНомер = Выборка.СчетОтправительНомер;
			ВидОперации          = Выборка.ВидОперацииППвх;
			СчетБУ               = Выборка.СчетБУПолучатель;
			// Если счет транзитный
			// Попробуем получить строку по ключу, обходим всю выборку пока не найдем 		
			Попытка
				Строка = СокрЛП(СтрокаЗначения[КлючОтправитель]);
			Исключение
				Продолжить	
			КонецПопытки;
			
			// Нашли ключ:
			
			Если СокрЛП(СтрокаЗначения[КлючОтправитель]) = СокрЛП(СчетОтправительНомер) Тогда
				СруктураДанных = Новый Структура("ВыполнятьДвижения,ВидОперации,СчетБУ",
				Ложь,ВидОперации, СчетБУ);
				Возврат СруктураДанных
			КонецЕсли;
			
		КонецЦикла;
		
		// не нашли ничего.
		Возврат Неопределено;		
		
		
	КонецЕсли;
	
КонецФункции

// Устанавливает вид платежа и субконто ПП исх
Процедура УстановитьВидОплатыСубконтоППисх(Документ, СтрокаЗначения)
	// Выбираем значение ключа р/сч
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОплатаИсходящаяБК.КлючСчетаПолучателя КАК Ключ
	|ИЗ
	|	РегистрСведений.ОплатаИсходящаяБК КАК ОплатаИсходящаяБК
	|ГДЕ
	|	ОплатаИсходящаяБК.БанкСчет = &БанкСчет";
	
	Запрос.УстановитьПараметр("БанкСчет", Документ.СчетОрганизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат
	КонецЕсли;
	
	Ключ = Выборка.Ключ;
	
	//выборка по регистру с отбором по счету получателю.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаИсходящаяБК.ВидОперации,
	|	ОплатаИсходящаяБК.СчетУчетаРасчетовСКонтрагентом,
	|	ОплатаИсходящаяБК.СубконтоДт1,
	|	ОплатаИсходящаяБК.СубконтоДт2,
	|	ОплатаИсходящаяБК.СубконтоДт3,
	|	ОплатаИсходящаяБК.СтатьяДвиженияДенежныхСредств,
	|	ОплатаИсходящаяБК.БанкСчет,
	|	ОплатаИсходящаяБК.СчетКонтрагента
	|ИЗ
	|	РегистрСведений.ОплатаИсходящаяБК КАК ОплатаИсходящаяБК
	|ГДЕ
	|	ОплатаИсходящаяБК.НомерСчетаПолучателя = &НомерСчетаПолучателя";
	
	НомерСчетаПолучателя = СтрокаЗначения[Ключ];
	Запрос.УстановитьПараметр("НомерСчетаПолучателя", СтрокаЗначения[Ключ]);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоРегистру = РезультатЗапроса.Выбрать();
	
	Если ВыборкаПоРегистру.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Документ, ВыборкаПоРегистру);
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает вид платежа и субконто ПП вх
Процедура УстановитьВидОплатыСубконтоППвх(Документ, СтрокаЗначения)
	// Выбираем значение ключа р/сч
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОплатаВходящаяБК.КлючСчетаОтправителя КАК Ключ
	|ИЗ
	|	РегистрСведений.ОплатаВходящаяБК КАК ОплатаВходящаяБК
	|ГДЕ
	|	ОплатаВходящаяБК.БанкСчет = &БанкСчет";
	
	Запрос.УстановитьПараметр("БанкСчет", Документ.СчетОрганизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат
	КонецЕсли;
	
	Ключ = Выборка.Ключ;
	
	//выборка по регистру с отбором по счету получателю.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаВходящаяБК.ВидОперации,
	|	ОплатаВходящаяБК.СчетУчетаРасчетовСКонтрагентом,
	|	ОплатаВходящаяБК.СубконтоКт1,
	|	ОплатаВходящаяБК.СубконтоКт2,
	|	ОплатаВходящаяБК.СубконтоКт3,
	|	ОплатаВходящаяБК.СтатьяДвиженияДенежныхСредств,
	|	ОплатаВходящаяБК.БанкСчет,
	|	ОплатаВходящаяБК.СчетКонтрагента
	|ИЗ
	|	РегистрСведений.ОплатаВходящаяБК КАК ОплатаВходящаяБК
	|ГДЕ
	|	ОплатаВходящаяБК.НомерСчетаОтправителя = &НомерСчетаОтправителя";
	
	НомерСчетаПолучателя = СтрокаЗначения[Ключ];
	Запрос.УстановитьПараметр("НомерСчетаОтправителя", СтрокаЗначения[Ключ]);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоРегистру = РезультатЗапроса.Выбрать();
	
	Если ВыборкаПоРегистру.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Документ, ВыборкаПоРегистру);
		
	КонецЕсли;
	
КонецПроцедуры

//Возвращает контрагента имеющего договор с УМК
Функция ПолучитьКонтрагентаУМК(ЕДРПОУ)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДоговорыКонтрагентов.Владелец = Контрагенты.Ссылка
	|ГДЕ
	|	Контрагенты.КодПоЕДРПОУ = &КодПоЕДРПОУ
	|	И ДоговорыКонтрагентов.Организация = &Организация");
	Запрос.УстановитьПараметр("КодПоЕДРПОУ", СокрЛП(ЕДРПОУ));
	Запрос.УстановитьПараметр("Организация", Константы.umk_ГоловнаяОрганизация.Получить()); //УМК
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Контрагент
КонецФункции

#КонецОбласти

#Область ТиповыхПроцедурФункцийЗаполненияДокументов

// Процедура записывает основной договор контрагента.
// ППВХ.
Процедура ПроверитьОсновнойДоговорКонтрагента(Контрагент)
	
	НайденныйДоговорОбъект              = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НайденныйДоговорОбъект.Наименование = "Основной договор";
	
	НайденныйДоговорОбъект.ВалютаВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяВалютаВзаиморасчетов");
	Если НЕ ЗначениеЗаполнено(НайденныйДоговорОбъект.ВалютаВзаиморасчетов) Тогда
		НайденныйДоговорОбъект.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;
	
	НайденныйДоговорОбъект.УстановитьСхемуНалогообложения();
	
	Если Контрагент.НеЯвляетсяРезидентом Тогда
		НайденныйДоговорОбъект.Внешнеэкономический = Истина;
		Если НайденныйДоговорОбъект.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета") Тогда
			НайденныйДоговорОбъект.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаУправленческогоУчета");
		КонецЕсли;
	КонецЕсли;
	
	НайденныйДоговорОбъект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	Если НЕ ЗначениеЗаполнено(НайденныйДоговорОбъект.Организация) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка,
		|	Организации.Наименование
		|ИЗ
		|	Справочник.Организации КАК Организации";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			НайденныйДоговорОбъект.Организация = Выборка.Ссылка;
		Иначе
			#Если Клиент Тогда
				Сообщить("Не удалось записать основной договор контрагента (не найдена организация).");
			#КонецЕсли
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	НайденныйДоговорОбъект.Владелец           = Контрагент.Ссылка;
	НайденныйДоговорОбъект.ВидУсловийДоговора = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
	
	Если Контрагент.Покупатель Тогда
		НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
		НайденныйДоговорОбъект.ТипЦен      = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();			
	ИначеЕсли Контрагент.Поставщик Тогда
		НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		НайденныйДоговорОбъект.ТипЦен      = Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка();			
	Иначе
		НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее;			
		НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	КонецЕсли;
	
	Если НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
		НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	Иначе
		НайденныйДоговорОбъект.ВедениеВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеВедениеВзаиморасчетовПоДоговорам");
		Если НЕ ЗначениеЗаполнено(НайденныйДоговорОбъект.ВедениеВзаиморасчетов) Тогда
			НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
		КонецЕсли;
		НайденныйДоговорОбъект.ВестиПоДокументамРасчетовСКонтрагентом = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновныеРасчетыПоДокументамСКонтрагентами");
		Если НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			НайденныйДоговорОбъект.ВестиПоДокументамРасчетовСКонтрагентомРегл = НайденныйДоговорОбъект.ВестиПоДокументамРасчетовСКонтрагентом;
		КонецЕсли;
	КонецЕсли;
	
	Если НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
		ИЛИ НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
		НайденныйДоговорОбъект.ОбособленныйУчетТоваровПоЗаказамПокупателей = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОбособленныйУчетТоваровПоЗаказамПокупателей");
	КонецЕсли;
	
	Если НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		НайденныйДоговорОбъект.ПроцентПредоплаты = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойРазмерПредоплатыПоЗаказуПокупателя");
	КонецЕсли;
	
	
	НайденныйДоговорОбъект.СложныйНалоговыйУчет 	  = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеЗначениеСложныйНалоговыйУчет");
	Если НайденныйДоговорОбъект.Внешнеэкономический Тогда
		НайденныйДоговорОбъект.СхемаНалоговогоУчета 	  = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ВЭД;
	Иначе	
		НайденныйДоговорОбъект.СхемаНалоговогоУчета 	  = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;
	КонецЕсли;
	НайденныйДоговорОбъект.СхемаНалоговогоУчетаПоТаре = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;
	
	НайденныйДоговорОбъект.ВыводитьИнформациюОСделкеПриПечатиДокументов = Истина;
	
	Попытка
		НайденныйДоговорОбъект.Записать();
	Исключение
		#Если Клиент Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, "Не удалось записать основной договор контрагента.");
		#КонецЕсли
		Возврат;
	КонецПопытки;
	
	Контрагент.ОсновнойДоговорКонтрагента = НайденныйДоговорОбъект.Ссылка;
	
	
КонецПроцедуры

// Определяем счета расчетов ППВХ
// Оставляем типовую процедуру, как она есть с перспективой на будущее.
Процедура ОпределитьСчетаУчетаРасчетовСКонтрагентомППВХ(СтрокаПлатеж, ЗаполнятьСчетаВзаиморасчетов = Истина, Документ)
	
	Если НЕ (Документ.ВидОперации = Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами) Тогда
		
		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Документ.Организация, Документ.Контрагент, СтрокаПлатеж.ДоговорКонтрагента);
		
		Если Документ.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю тогда
			
			Если ЗаполнятьСчетаВзаиморасчетов Тогда
				
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетовПокупателя;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = СчетаУчета.СчетАвансовПокупателя;
				
			КонецЕсли;
			
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПродаж;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПродаж;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПродажПоТаре;
			КонецЕсли;
			
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПродаж,СтрокаПлатеж.СтавкаНДС);
			
			
		ИначеЕсли Документ.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами тогда
			
			Если ЗаполнятьСчетаВзаиморасчетов Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетов;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
				
			КонецЕсли;
			
		Иначе
			
			Если ЗаполнятьСчетаВзаиморасчетов Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом  = СчетаУчета.СчетРасчетовПокупателя;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам      = СчетаУчета.СчетАвансовПокупателя;
			КонецЕсли;	
			
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПродаж;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПродаж;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПродажПоТаре;
			КонецЕсли;
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПродаж, СтрокаПлатеж.СтавкаНДС);
			СтрокаПлатеж.Амортизируется                 = СчетаУчета.Амортизируется;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Определяем счета расчетов ППИСХ
// Оставляем типовую процедуру, как она есть с перспективой на будущее.
Процедура ОпределитьСчетаУчетаРасчетовСКонтрагентомППИСХ(СтрокаПлатеж, ЗаполнятьСчетаВзаиморасчетов = Истина, Документ) Экспорт
	
	Если НЕ (Документ.ВидОперации = Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами) Тогда
		
		СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(Документ.Организация, Документ.Контрагент, СтрокаПлатеж.ДоговорКонтрагента);
		
		Если Документ.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю тогда
			
			Если ЗаполнятьСчетаВзаиморасчетов Тогда
				
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетовПокупателя;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = СчетаУчета.СчетАвансовПокупателя;
				
			КонецЕсли;
			
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПродаж;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПродаж;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПродажПоТаре;
			КонецЕсли;
			
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПродаж,СтрокаПлатеж.СтавкаНДС);
			
			
		ИначеЕсли Документ.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами тогда
			
			Если ЗаполнятьСчетаВзаиморасчетов Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетов;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
				
			КонецЕсли;
			
		Иначе
			
			Если ЗаполнятьСчетаВзаиморасчетов Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом  = СчетаУчета.СчетРасчетов;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам      = СчетаУчета.СчетАвансов;
			КонецЕсли;	
			
			СтрокаПлатеж.СчетУчетаНДС    				= СчетаУчета.СчетУчетаНДСПриобретений;
			СтрокаПлатеж.СчетУчетаНДСПодтвержденный     = СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
			СтрокаПлатеж.НалоговоеНазначение 			= СчетаУчета.НалоговоеНазначениеПриобретений;
			Если СтрокаПлатеж.ЗаТару Тогда
				СтрокаПлатеж.НалоговоеНазначение 		= СчетаУчета.НалоговоеНазначениеПриобретенийПоТаре;
			КонецЕсли;
			СтрокаПлатеж.СтавкаНДС		  				= ?(ЗаполнятьСчетаВзаиморасчетов,СчетаУчета.СтавкаНДСПриобретений,СтрокаПлатеж.СтавкаНДС);
			СтрокаПлатеж.Амортизируется                 = СчетаУчета.Амортизируется;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Проводит загруженные документы
//
Процедура ПровестиДокументы()
	
	Для Каждого Элемент из МассивДокументов Цикл
		Документ = Элемент.ПолучитьОбъект();
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ОписаниеОшибки());
			Документ.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки	
	КонецЦикла;
	
КонецПроцедуры

//Проверяет выгружаем на дату или за период
//
Функция ВыборкаПоДате()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Путь_К_КаталогуКлиентБанка.ПутьКФайлу,
	|   Путь_К_КаталогуКлиентБанка.ЗагрузкаПоДате,
	|	Путь_К_КаталогуКлиентБанка.ИмяФайла
	| ИЗ
	|	РегистрСведений.umk_Путь_К_КаталогуКлиентБанка КАК Путь_К_КаталогуКлиентБанка
	| ГДЕ
	|	Путь_К_КаталогуКлиентБанка.БанковскийСчет = &БанковскийСчет";
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗагрузкаПоДате 
	КонецЕсли;
	
	Возврат Ложь
	
КонецФункции	

// Процедура выполняет необходимые действия при изменении договора взаиморасчетов
// с контрагентом ПП исход.
//
Процедура ПриИзмененииДоговораППИСХ(Документ, СтрокаПлатеж)
	
	СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = СтрокаПлатеж.ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств; 
	УправлениеДенежнымиСредствами.УстановитьСтатьюДДСПоУмолчанию(СтрокаПлатеж, Документ.ВидОперации);
	
	СтрокаПлатеж.ДокументПланированияПлатежа = Документы.ЗаявкаНаРасходованиеСредств.ПустаяСсылка();
	СтрокаПлатеж.Сделка	= Неопределено;
	СтрокаПлатеж.ДокументРасчетовСКонтрагентом = Неопределено;
	
	мТекущаяВалютаВзаиморасчетов = СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	
	СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(мТекущаяВалютаВзаиморасчетов, ?(Документ.ДатаОплаты='00010101',Документ.Дата,КонецДня(Документ.ДатаОплаты)));
	
	СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
	
	// + РассчитатьСуммуВзаиморасчетов
	
	ПроверкаКурсовВалют(СтрокаПлатеж, Документ);
	
	Если мТекущаяВалютаВзаиморасчетов = Документ.ВалютаДокумента Тогда
		СтрокаПлатеж.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа;
	ИначеЕсли (Документ.КурсДокумента <> 0) И (СтрокаПлатеж.КратностьВзаиморасчетов <> 0) И (СтрокаПлатеж.КурсВзаиморасчетов <> 0) Тогда
		СтрокаПлатеж.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
		СтрокаПлатеж.СуммаПлатежа, 
		Документ.ВалютаДокумента, мТекущаяВалютаВзаиморасчетов,
		Документ.КурсДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
		Документ.КратностьДокумента, СтрокаПлатеж.КратностьВзаиморасчетов);
	Иначе
		СтрокаПлатеж.СуммаВзаиморасчетов = 0;
	КонецЕсли;
	
	// - РассчитатьСуммуВзаиморасчетов
	
	СтрокаПлатеж.СтавкаНДС = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяСтавкаНДС");
	
	Если ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента.ОсновнойПроект) Тогда
		СтрокаПлатеж.Проект = СтрокаПлатеж.ДоговорКонтрагента.ОсновнойПроект;
	КонецЕсли;
	
	ОпределитьСчетаУчетаРасчетовСКонтрагентомППИСХ(СтрокаПлатеж,,Документ);
	
	УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(СтрокаПлатеж);
	
КонецПроцедуры // ПриИзмененииДоговора()	

// Проверяет установленные курсы валют документа перед пересчетом сумм
// Нулевые курсы устанавливаются в 1
//
Процедура ПроверкаКурсовВалют(СтрокаПлатеж, Документ)
	
	Документ.КурсДокумента      = ?( Документ.КурсДокумента      = 0, 1,  Документ.КурсДокумента);
	Документ.КратностьДокумента = ?(Документ.КратностьДокумента = 0, 1, Документ.КратностьДокумента);
	
	Если Не СтрокаПлатеж = Неопределено Тогда
		
		СтрокаПлатеж.КурсВзаиморасчетов      = ?(СтрокаПлатеж.КурсВзаиморасчетов      = 0, 1, СтрокаПлатеж.КурсВзаиморасчетов);
		СтрокаПлатеж.КратностьВзаиморасчетов = ?(СтрокаПлатеж.КратностьВзаиморасчетов = 0, 1, СтрокаПлатеж.КратностьВзаиморасчетов);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверкаКурсовВалют()

#КонецОбласти 

МассивДокументов = Новый Массив;
